{
    "task1146_country_capital": "In this task, you are given a country name and you need to return the capital city of the given country",
    "task1147_country_currency": "You are given a country name and you need to return the currency of the given country.",
    "task1321_country_continent": "In this task, you are given a country name and you need to return the continent to which the country belongs.",
    "task1149_item_check_edible": "In this task, you are given an item and you need to check whether it is edible or not, return 1 if it is edible, else return 2.",
    "task429_senteval_tense": "In this task you are given a sentence. You must judge whether the main verb of the sentence is in present or past tense. Label the instances as \"Present\" or \"Past\" based on your judgment. If there is no verb in the given text, answer \"Present\".",
    "task430_senteval_subject_count": "In this task you are given a sentence. You must judge whether subject of the main clause is singular or plural. Label the instances as \"Singular\" or \"Plural\" based on your judgment.",
    "task609_sbic_potentially_offense_binary_classification": "In this task, you are given a text from a social media post. Your task is to classify the given post into two categories: 1) yes if the given post is potentially offensive to anyone (i.e., a subset of people, any particular person, etc.), 2) no, otherwise. Note that potentially offensive posts can contain sexual, racial, religious biased or offensive language. Warning: the examples and instances may contain offensive language.",
    "task063_first_i_elements": "In this task, you are given inputs i and A, where i is an integer and A is a list. You need to output the first i elements of A, starting with the 1st element in A. i will always have a value less than the length of A",
    "task064_all_elements_except_first_i": "In this task, you are given inputs i and A, where i is an integer and A is a list. You need to list all the elements of A after the first i elements. i will always have a value less than the length of A.",
    "task088_identify_typo_verification": "The given sentence contains a typo which could be one of the following four types: (1) swapped letters of a word e.g. 'niec' is a typo of the word 'nice'. (2) missing letter in a word e.g. 'nic' is a typo of the word 'nice'. (3) extra letter in a word e.g. 'nicce' is a typo of the word 'nice'. (4) replaced letter in a word e.g 'nicr' is a typo of the word 'nice'. You need to identify the typo in the given sentence. To do this, answer with the word containing the typo.",
    "task092_check_prime_classification": "In this task, you need to output 'Yes' if the given number is a prime number otherwise output 'No'. A 'prime number' is a a whole number above 1 that can not be made by multiplying other whole numbers.",
    "task107_splash_question_to_sql": "In this task you are expected to write an SQL query that will return the data asked for in the question. An SQL query works by selecting data from a table where certain conditions apply. A table contains columns where every row in that table must have a value for each column. Every table has a primary key that uniquely identifies each row, usually an id. To choose which columns are returned you specify that after the \"SELECT\" statement. Next, you use a \"FROM\" statement to specify what tables you want to select the data from. When you specify a table you can rename it with the \"AS\" statement. You can reference that table by whatever name follows the \"AS\" statement. If you want to select data from multiple tables you need to use the \"JOIN\" statement. This will join the tables together by pairing a row in one table with every row in the other table (Cartesian Product). To limit the number of rows returned you should use the \"ON\" statement. This will only return rows where the condition specified after the statement is true, this is usually an equals operator with primary keys. You can also use the \"WHERE\" statement to specify that only rows with column values statisfying a certain condition, should be returned. The \"GROUP BY\" statement will group rows together that have equal column values for whatever columns follows the statement. The \"HAVING\" statement will return groups that statisfy whatever condition follows the statement. Any column(s) being returned from grouped rows must either be an aggregate function, (AVG, MAX, COUNT, SUM, ...) of a column, or the column(s) that the data was grouped by. To sort the returned data you can use the \"ORDER BY\" command which will order the data by whatever aggregate function or column follows the statement. The \"DESC\" statement will sort in descending order and the \"ASC\" statement will sort in ascending order. Finally, you can use the \"LIMIT\" statement to return a certain number of rows. When \"*\" is used in an SQL statement every column is returned. For example, SELECT * FROM table WHERE attribute = 1, will select every column from rows with the attribute column equal to 1.",
    "task114_is_the_given_word_longest": "In this task, you need to answer 'Yes' if the given word is the longest word (in terms of number of letters) in the given sentence, else answer 'No'. Note that there could be multiple longest words in a sentence as they can have the same length that is the largest across all words in that sentence.",
    "task123_conala_sort_dictionary": "In this task you will be given a list of dictionaries. A dictionary is a set of key-value pairs, where each key is unique and has a value associated with that key. You should sort the list of dictionaries from smallest to largest by their 'first' key. If there is two dictionaries with the same 'first' value then sort them by their 'second' key. Negative numbers should come before positive numbers.",
    "task183_rhyme_generation": "Given an input word generate a word that rhymes exactly with the input word. If not rhyme is found return \"No\"",
    "task1191_food_veg_nonveg": "In this task, you are given the name of an Indian food dish. You need to return whether the dish is \"non vegetarian\" or \"vegetarian\". Do not answer with any words other than those two.",
    "task1336_peixian_equity_evaluation_corpus_gender_classifier": "You will be given a sentence containing a pronoun/person name and an emotion. From these implicit parameters, the main goal is to find the gender of the person (male / female).",
    "task1509_evalution_antonyms": "In this task, you are given an adjective, and your job is to generate its antonym. An antonym of a word is a word opposite in meaning to it.",
    "task1506_celebrity_minimal_dob_span": "Given a short bio of a person, find the minimal text span containing the date of birth of the person. The output must be the minimal text span that contains the birth date, month and year as long as they are present. For instance, given a bio like 'I was born on 27th of Decemeber 1990, and graduated high school on 23rd October 2008.' the output should be '27th of December 1990'."
}